kspraveeen/sdk-nrf/drivers/wifi/nrf71/src/common/util_shell.c
	for (i = 0; i < num_tx_tokens && i < NRF71_MAX_TX_TOKENS; i++) {
		unsigned int cmds = ts->token_cmds[i];
		unsigned int pkts_x100 = cmds ? ((ts->token_pkts[i] * 100U) / cmds) : 0U;
		unsigned int bytes_per_cmd = cmds ?
			(unsigned int)(ts->token_bytes[i] / cmds) : 0U;
		bool spare = (i >= (num_tx_tokens_per_ac * NRF_WIFI_FMAC_AC_MAX));

		shell_fprintf(sh, SHELL_INFO,
			      "%-4u %8u %9u %10u %6u.%02u %10u %4u%% %9u %10u %s\n",
			      i,
			      ts->token_acq[i],
			      cmds,
			      ts->token_pkts[i],
			      pkts_x100 / 100U,
			      pkts_x100 % 100U,
			      bytes_per_cmd,
			      cap ? ((bytes_per_cmd * 100U) / cap) : 0U,
			      ts->token_max_pkts[i],
			      ts->token_max_bytes[i],
			      spare ? "spare" : ac_str(i % NRF_WIFI_FMAC_AC_MAX));
	}

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Aggregation: packets per TX command ---\n");

	for (i = 0; i < MAX_TX_AGG_SIZE; i++) {
		if (ts->pkts_per_cmd[i] == 0) {
			continue;
		}

		shell_fprintf(sh, SHELL_INFO,
			      "%2u pkt(s) - %u cmd(s) (%u.%02u%%)\n",
			      i + 1,
			      ts->pkts_per_cmd[i],
			      ts->tx_cmds ?
				      ((ts->pkts_per_cmd[i] * 100U) / ts->tx_cmds) : 0U,
			      ts->tx_cmds ?
				      (((ts->pkts_per_cmd[i] * 10000U) / ts->tx_cmds) % 100U) :
				      0U);
	}

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Aggregation: token fill level (%% of %u B cap) ---\n",
		      cap);

	for (i = 0; i < TX_TOKEN_FILL_BUCKETS; i++) {
		if (ts->fill_hist[i] == 0) {
			continue;
		}

		shell_fprintf(sh, SHELL_INFO,
			      "%3u-%3u%% - %u cmd(s)\n",
			      i * (100U / TX_TOKEN_FILL_BUCKETS),
			      (i + 1) * (100U / TX_TOKEN_FILL_BUCKETS),
			      ts->fill_hist[i]);
	}

	shell_fprintf(sh, SHELL_INFO,
		      "\nTX cmds: %u, pkts: %u, data: %llu B, occupancy: %llu B, "
		      "max cmd: %u B\n",
		      ts->tx_cmds,
		      ts->tx_cmd_pkts,
		      ts->tx_cmd_data_bytes,
		      ts->tx_cmd_bytes,
		      ts->max_cmd_bytes);
	shell_fprintf(sh, SHELL_INFO,
		      "TX dones: %u\n",
		      ts->tx_dones);

	if (ts->tx_cmds) {
		unsigned int avg_pkts_x100 = (unsigned int)((ts->tx_cmd_pkts * 100ULL) /
							    ts->tx_cmds);
		unsigned int avg_bytes = (unsigned int)(ts->tx_cmd_bytes / ts->tx_cmds);
		unsigned int avg_pkt_len = ts->tx_cmd_pkts ?
			(unsigned int)(ts->tx_cmd_data_bytes / ts->tx_cmd_pkts) : 0U;

		shell_fprintf(sh, SHELL_INFO,
			      "avg_tx pkts/TX cmd: %u.%02u (of %u), "
			      "avg bytes/TX cmd: %u (%u%% of cap), avg pkt: %u B\n",
			      avg_pkts_x100 / 100U,
			      avg_pkts_x100 % 100U,
			      max_aggr,
			      avg_bytes,
			      cap ? ((avg_bytes * 100U) / cap) : 0U,
			      avg_pkt_len);
	} else {
		shell_fprintf(sh, SHELL_INFO, "avg_tx pkts/TX cmd: n/a\n");
	}

	aggr_stops = ts->aggr_stop_size + ts->aggr_stop_count + ts->aggr_stop_mismatch +
		     ts->aggr_stop_twt + ts->aggr_stop_q_empty;

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Why aggregation stopped (%u events) ---\n",
		      aggr_stops);
	shell_fprintf(sh, SHELL_INFO,
		      "size cap hit   : %u\n"
		      "count cap hit  : %u\n"
		      "SA/RA mismatch : %u\n"
		      "TWT sleep      : %u\n"
		      "pend_q empty   : %u\n"
		      "forced single  : %u\n",
		      ts->aggr_stop_size,
		      ts->aggr_stop_count,
		      ts->aggr_stop_mismatch,
		      ts->aggr_stop_twt,
		      ts->aggr_stop_q_empty,
		      ts->aggr_forced_single);

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Per-AC token accounting ---\n");
	shell_fprintf(sh, SHELL_INFO,
		      "%-4s %10s %10s %10s %10s %10s %10s\n",
		      "ac", "reserved", "spare", "fail", "max_out", "max_qlen", "q_full");

	for (i = 0; i < NRF_WIFI_FMAC_AC_MAX; i++) {
		total_gets += ts->reserved_token_get[i] + ts->spare_token_get[i];
		total_fails += ts->token_get_fail[i];

		shell_fprintf(sh, SHELL_INFO,
			      "%-4s %10u %10u %10u %10u %10u %10u\n",
			      ac_str(i),
			      ts->reserved_token_get[i],
			      ts->spare_token_get[i],
			      ts->token_get_fail[i],
			      ts->max_outstanding_descs[i],
			      ts->max_pending_qlen[i],
			      ts->pend_q_full_drops[i]);
	}

	shell_fprintf(sh, SHELL_INFO,
		      "token gets: %u, failures: %u (%u%% starved), spare AC switches: %u\n",
		      total_gets,
		      total_fails,
		      (total_gets + total_fails) ?
			      ((total_fails * 100U) / (total_gets + total_fails)) : 0U,
		      ts->spare_token_ac_switch);

	shell_fprintf(sh, SHELL_INFO,
		      "\n--- Host TX path ---\n");
	shell_fprintf(sh, SHELL_INFO,
		      "if_send calls: %u (xmit: %u, queued: %u)\n",
		      ts->if_send_calls,
		      ts->if_send_xmit,
		      ts->if_send_queued);
	shell_fprintf(sh, SHELL_INFO,
		      "pkts held in host (no token/aggregating/PS): %u\n",
		      ts->pkts_queued);
	shell_fprintf(sh, SHELL_INFO,
		      "if_send drops: no_nbuf: %u, unknown_peer: %u, not_ready: %u, "
		      "fmac_fail: %u\n",
		      ts->if_drop_no_nbuf,
		      ts->if_drop_unknown_peer,
		      ts->if_drop_not_ready,
		      ts->if_drop_fmac_fail);
	shell_fprintf(sh, SHELL_INFO,
		      "host pkts: tx: %llu, tx_done: %llu, tx_drop: %llu\n",
		      (unsigned long long)sys_dev_ctx->host_stats.total_tx_pkts,
		      (unsigned long long)sys_dev_ctx->host_stats.total_tx_done_pkts,
		      (unsigned long long)sys_dev_ctx->host_stats.total_tx_drop_pkts);
}

static int nrf_wifi_util_tx_stats(const struct shell *sh,
				  size_t argc,
				  const char *argv[])
{
	int vif_index = -1;
	int peer_index = 0;
	int max_vif_index = MAX(MAX_NUM_APS, MAX_NUM_STAS);
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_sys_fmac_priv *sys_fpriv = NULL;
	unsigned int tx_pending_pkts = 0;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	bool clear = false;
	int ret;

	if ((argc > 2) && (strcmp(argv[2], "clear") == 0)) {
		clear = true;
	} else if (argc > 2) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid argument \"%s\".\n",
			      argv[2]);
		shell_help(sh);
		return -ENOEXEC;
	}

	vif_index = atoi(argv[1]);
	if ((vif_index < 0) || (vif_index >= max_vif_index)) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid vif index(%d).\n",
			      vif_index);
		shell_help(sh);
		return -ENOEXEC;
	}

	k_mutex_lock(&ctx->rpu_lock, K_FOREVER);
	if (!ctx->rpu_ctx) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "RPU context not initialized\n");
		ret = -ENOEXEC;
		goto unlock;
	}

